[Killed] Null coalescing mutation (remove left)
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:134:21
         ArgumentNullException.ThrowIfNull(instance);
         _frozen = true;
         var accessor = _stateAccessor ?? throw new InvalidOperationException("InstanceState must be configured before raising events.");
-        var state = accessor.Get(instance) ?? Initial;
+        var state = Initial;
 
         if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Typed_ignore_accepts_data_without_effect_or_state_change; Autonomata.Tests.StateMachineTests.Unhandled_event_identifies_event_and_state

[Killed] Logical mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:136:13
         var accessor = _stateAccessor ?? throw new InvalidOperationException("InstanceState must be configured before raising events.");
         var state = accessor.Get(instance) ?? Initial;
 
-        if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
-            !_anyBehaviors.TryGetValue(@event, out behavior))
+        if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) ||
+            !_anyBehaviors.TryGetValue(@event, out behavior))
         {
             throw new UnhandledEventException(@event, state);
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Typed_ignore_accepts_data_without_effect_or_state_change; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps

[Killed] Negate expression
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:136:13
         var accessor = _stateAccessor ?? throw new InvalidOperationException("InstanceState must be configured before raising events.");
         var state = accessor.Get(instance) ?? Initial;
 
-        if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
-            !_anyBehaviors.TryGetValue(@event, out behavior))
+        if (!(!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
+            !_anyBehaviors.TryGetValue(@event, out behavior)))
         {
             throw new UnhandledEventException(@event, state);
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Typed_ignore_accepts_data_without_effect_or_state_change; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:137:13
         var state = accessor.Get(instance) ?? Initial;
 
         if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
-            !_anyBehaviors.TryGetValue(@event, out behavior))
+            _anyBehaviors.TryGetValue(@event, out behavior))
         {
             throw new UnhandledEventException(@event, state);
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Unhandled_event_identifies_event_and_state

[Killed] Statement mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:139:13
         if (!_stateBehaviors.TryGetValue((state, @event), out var behavior) &&
             !_anyBehaviors.TryGetValue(@event, out behavior))
         {
-            throw new UnhandledEventException(@event, state);
+            ;
         }
 
killedBy: Autonomata.Tests.StateMachineTests.Unhandled_event_identifies_event_and_state

[Killed] Negate expression
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:142:13
             throw new UnhandledEventException(@event, state);
         }
 
-        if (behavior.IsIgnored)
+        if (!(behavior.IsIgnored))
         {
             return;
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps; Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Killed] Statement mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:152:21
             switch (step.Kind)
             {
                 case BehaviorStepKind.Callback:
-                    await step.Invoke!(instance, data).ConfigureAwait(false);
+                    ;
                     break;
                 case BehaviorStepKind.Transition:
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps; Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Survived] Boolean mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:152:71
             switch (step.Kind)
             {
                 case BehaviorStepKind.Callback:
-                    await step.Invoke!(instance, data).ConfigureAwait(false);
+                    await step.Invoke!(instance, data).ConfigureAwait(true);
                     break;
                 case BehaviorStepKind.Transition:

[Killed] Statement mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:155:21
                     await step.Invoke!(instance, data).ConfigureAwait(false);
                     break;
                 case BehaviorStepKind.Transition:
-                    accessor.Set(instance, step.Target!);
+                    ;
                     break;
                 case BehaviorStepKind.Finalize:
killedBy: Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order; Autonomata.Tests.StateMachineTests.Typed_async_behavior_is_awaited_and_can_transition; Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks

[Killed] Statement mutation
state machine lib/src/Autonomata/AutomatonymousStateMachine.cs:158:21
                     accessor.Set(instance, step.Target!);
                     break;
                 case BehaviorStepKind.Finalize:
-                    accessor.Set(instance, Final);
+                    ;
                     break;
                 default:
killedBy: Autonomata.Tests.StateMachineTests.Finalize_transitions_to_distinguished_final_state; Autonomata.Tests.StateMachineTests.Typed_finalize_persists_distinguished_final_state
