[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:22:9
     public EventActivityBinder<TInstance> Then(Action<BehaviorContext<TInstance>> callback)
     {
         ArgumentNullException.ThrowIfNull(callback);
-        AddStep(BehaviorStep<TInstance>.Callback((instance, _) =>
-        {
-            callback(new BehaviorContext<TInstance>(instance, Event));
-            return Task.CompletedTask;
-        }));
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps; Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:24:13
         ArgumentNullException.ThrowIfNull(callback);
         AddStep(BehaviorStep<TInstance>.Callback((instance, _) =>
         {
-            callback(new BehaviorContext<TInstance>(instance, Event));
+            ;
             return Task.CompletedTask;
         }));
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps; Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:34:9
     public EventActivityBinder<TInstance> ThenAsync(Func<BehaviorContext<TInstance>, Task> callback)
     {
         ArgumentNullException.ThrowIfNull(callback);
-        AddStep(BehaviorStep<TInstance>.Callback((instance, _) =>
-            callback(new BehaviorContext<TInstance>(instance, Event))));
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:43:9
     public EventActivityBinder<TInstance> TransitionTo(State state)
     {
         ArgumentNullException.ThrowIfNull(state);
-        AddStep(BehaviorStep<TInstance>.Transition(state));
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order; Autonomata.Tests.StateMachineTests.Typed_async_behavior_is_awaited_and_can_transition; Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:50:9
     /// <summary>Adds a transition to the distinguished final state.</summary>
     public EventActivityBinder<TInstance> Finalize()
     {
-        AddStep(BehaviorStep<TInstance>.FinalizeStep());
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Finalize_transitions_to_distinguished_final_state; Autonomata.Tests.StateMachineTests.Typed_finalize_persists_distinguished_final_state

[Survived] Boolean mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:62:21
             throw new InvalidOperationException("Ignore cannot be combined with behavior steps.");
         }
 
-        IsIgnored = true;
+        IsIgnored = false;
         return this;
     }

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:81:9
             throw new InvalidOperationException("Behavior steps cannot be added after Ignore.");
         }
 
-        _steps.Add(step);
+        ;
     }
 }
killedBy: Autonomata.Tests.StateMachineTests.State_specific_behavior_wins_over_during_any_fallback; Autonomata.Tests.StateMachineTests.Callback_failure_preserves_prior_effects_and_stops_later_steps; Autonomata.Tests.StateMachineTests.Async_behavior_is_awaited_in_declaration_order

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:99:9
     public EventActivityBinder<TInstance, TData> Then(Action<BehaviorContext<TInstance, TData>> callback)
     {
         ArgumentNullException.ThrowIfNull(callback);
-        AddStep(BehaviorStep<TInstance>.Callback((instance, data) =>
-        {
-            callback(new BehaviorContext<TInstance, TData>(instance, _event, (TData)data!));
-            return Task.CompletedTask;
-        }));
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks; Autonomata.Tests.StateMachineTests.Typed_event_exposes_instance_event_and_data

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:101:13
         ArgumentNullException.ThrowIfNull(callback);
         AddStep(BehaviorStep<TInstance>.Callback((instance, data) =>
         {
-            callback(new BehaviorContext<TInstance, TData>(instance, _event, (TData)data!));
+            ;
             return Task.CompletedTask;
         }));
killedBy: Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks; Autonomata.Tests.StateMachineTests.Typed_event_exposes_instance_event_and_data

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:111:9
     public EventActivityBinder<TInstance, TData> ThenAsync(Func<BehaviorContext<TInstance, TData>, Task> callback)
     {
         ArgumentNullException.ThrowIfNull(callback);
-        AddStep(BehaviorStep<TInstance>.Callback((instance, data) =>
-            callback(new BehaviorContext<TInstance, TData>(instance, _event, (TData)data!))));
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Typed_async_behavior_is_awaited_and_can_transition; Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:119:9
     /// <inheritdoc />
     public new EventActivityBinder<TInstance, TData> TransitionTo(State state)
     {
-        base.TransitionTo(state);
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Typed_async_behavior_is_awaited_and_can_transition; Autonomata.Tests.StateMachineTests.Typed_event_preserves_payload_identity_through_ordered_callbacks

[Killed] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:126:9
     /// <inheritdoc />
     public new EventActivityBinder<TInstance, TData> Finalize()
     {
-        base.Finalize();
+        ;
         return this;
     }
killedBy: Autonomata.Tests.StateMachineTests.Typed_finalize_persists_distinguished_final_state

[Survived] Statement mutation
state machine lib/src/Autonomata/EventActivityBinder.cs:133:9
     /// <inheritdoc />
     public new EventActivityBinder<TInstance, TData> Ignore()
     {
-        base.Ignore();
+        ;
         return this;
     }
